{	
	"title": "Previous Leeds Testing Ateliers",
	"previousAteliers":
	[
		{ 
			"class"	: "atelierEight",
			"eventName" : "Atelier VIII - Wharf Chambers - Tuesday June 25th 2019",
			"eventDescription" : "Holy mackerel! The Atelier returned with a summer edition, this time with a focus on security, mental health, communication, failure and many more. There were even two gameshows for the audience to enjoy. Someone said 'maybe the gameshows didn't add much value.' They added HILARITY and ARBITRARILY ENFORCED RULES. There should be more of hilarity in testing, but less rules arbitrarily enforced by despots drunk on power, definitions and semantics. All in all, an absolute blast had by many, learning by all. Shame about the rain, you can't trust the weather. It's grim up north you know.",
			"pictureOnePath" : "./images/previousateliers/atelier-eight-test-friends.jpg",
			"pictureOneAltText" : "Testing Friends from Newcastle",
			"pictureTwoPath" : "./images/previousateliers/atelier-eight-bullseye.jpg",
			"pictureTwoAltText" : "Ash and Richie play Bullseye",
			"pictureThreePath" : "./images/previousateliers/atelier-eight-jay-harris.jpg",
			"pictureThreeAltText" : "Jay Harris Legend of Security",
			"pictureFourPath" : "./images/previousateliers/atelier-eight-beth-north.jpg",
			"pictureFourAltText" : "Brilliant Beth North Squashing Imposter Goblins"
		},
		{ 
			"class"	: "atelierSeven",
			"eventName" : "Atelier VII - Wharf Chambers - Tuesday October 9th 2018",
			"eventDescription" : "Unbelievable scenes! The Atelier was back and better than ever. DevOps was what the people wanted and DevOps is what they got. Pipelines, operability, culture and even Kubernetes. Plus the usual dose of testing content too, covering accessibility, transferable skills, crucial conversations and so much more. We even ran out of beer money we celebrated so hard. Or perhaps that was the amount of tea we drank. The Atelier loves a strong finish and Defend the Indefensible delivered. Wince-inducing statements defended by the willing for 30 seconds. It was blissful chaos.",
			"pictureOnePath" : "./images/previousateliers/atelier-seven-alex.jpg",
			"pictureOneAltText" : "Alex Moore talks operability, culture and testing",
			"pictureTwoPath" : "./images/previousateliers/atelier-seven-chris-vern.jpg",
			"pictureTwoAltText" : "Chris and Vern prompt crucial conversations",
			"pictureThreePath" : "./images/previousateliers/atelier-seven-lewis.jpg",
			"pictureThreeAltText" : "Lewis on the power of contract testing",
			"pictureFourPath" : "./images/previousateliers/atelier-seven-suman-phil.jpg",
			"pictureFourAltText" : "Suman and Phil with a rollercoaster automation journey"
		},
		{ 
			"class"	: "atelierSix",
			"eventName" : "Atelier VI - Wharf Chambers - Tuesday 17th April 2018",
			"eventDescription" : "The Atelier returned. This time with game shows, new speakers, extra workshops and fridge magnets. The group insanity triggered during the 'Testing is Pointless' gameshow will live long in the memory. All we can say is 'Blublublublublublublublublublublublublublub.' Like the cyborg of a conference we are, we also augmented ourselves with extra media capabiities, superior vegan food and even an after party. From test automation in AWS to mental health awareness workshops this was an eclectic Atelier with a little something for everybody, which, after all, is what the Atelier is all about.",
			"pictureOnePath" : "./images/previousateliers/atelier-six-viv.jpg",
			"pictureOneAltText" : "Viv gives his hundredth visual testing talk",
			"pictureTwoPath" : "./images/previousateliers/atelier-six-frances.jpg",
			"pictureTwoAltText" : "Frances rocks her automation learning journey",
			"pictureThreePath" : "./images/previousateliers/atelier-six-heather.jpg",
			"pictureThreeAltText" : "Heather on the power of onboarding!",
			"pictureFourPath" : "./images/previousateliers/atelier-six-pointless.jpg",
			"pictureFourAltText" : "The greatest gameshow ever. End of discussion"
		},
		{ 
			"class"	: "atelierFive",
			"eventName" : "Atelier V - Wharf Chambers - Tuesday 17th October 2017",
			"eventDescription" : "We did it again again. Another punk, free, independent Leeds Testing Atelier happened on the 17th October 2017. Thats number five for those of you counting wristbands. The technology sector in Leeds grows constantly, with big companies like Sky and Skybet having a massive presence in the city. However, Leeds has always had a strong DIY scene for music and the arts, we want to maintain that in our tech scene too. This is what we hope will make us and keep us different. Our venue is a place where other groups meet, to make music, discuss social issues or advocate for the environment. To be part of that community matches our mission and our hopes for tech in Leeds.",
			"pictureOnePath" : "./images/previousateliers/atelier-five-owl.jpg",
			"pictureOneAltText" : "This is Leeds, we like owls a lot",
			"pictureTwoPath" : "./images/previousateliers/atelier-five-gwilliam.jpg",
			"pictureTwoAltText" : "Jenny describes her testing to Scrum Master journey",
			"pictureThreePath" : "./images/previousateliers/atelier-five-walkinshaw.jpg",
			"pictureThreeAltText" : "Lesley describes why we build better together",
			"pictureFourPath" : "./images/previousateliers/atelier-five-warren.jpg",
			"pictureFourAltText" : "Chris Warren on shifting testing left"
		},
		{ 
			"class"	: "atelierFour",
			"eventName" : "Atelier IV - Wharf Chambers - Tuesday 9th May 2017",
			"eventDescription" : "We did it again, the fourth iteration of the Testing Atelier rocked the mighty city of Leeds. We try to do things a little different. Our venue Wharf Chambers is different, a community run venue rather than stuffy conference halls or meeting rooms. We wanted to present a different type of event too as many testing conferences are mainly testers talking about testing that testers do. We wanted to show testing as an activity though, something that all roles do in their own way and how those fit together. To this end, we sourced speakers, workshop facilitators and panelists from loads of roles, developers, ops, build engineers, product all contributed. In fact we had pretty much a 50/50 split between testers and other roles. Winning.",
			"pictureOnePath" : "./images/previousateliers/atelier-four-intro.jpg",
			"pictureOneAltText" : "Gwen smashing the intro to little pieces",
			"pictureTwoPath" : "./images/previousateliers/atelier-four-panel.jpg",
			"pictureTwoAltText" : "Great testers and dinosaurs, what more do you want?",
			"pictureThreePath" : "./images/previousateliers/atelier-four-devops.jpg",
			"pictureThreeAltText" : "Alex Moore and the 3 ways of devops",
			"pictureFourPath" : "./images/previousateliers/atelier-four-bar.jpg",
			"pictureFourAltText" : "The lovely bar of Wharf Chambers"
		},
		{ 
			"class"	: "atelierThree",
			"eventName" : "Atelier III - Wharf Chambers - Tuesday 20th September 2016",
			"eventDescription" : "We got bigger! But kept our independent feel of course. This time Wharf gave us both floors of their fantastic bar and gig space to fully showcase our two track style, humans upstairs, robots downstairs. Almost 100 keen testers, developers, designers, analysts and operations people packed in to hear Gwen Diagram rock as the days compere, we heard from about mobile test automation, design, usability, how to hire great testers, how testers break developers hearts, testability of teapots, finished with a host of games and presentation karaoke!",
			"pictureOnePath" : "./images/previousateliers/atelier-three-gwen-intro.jpg",
			"pictureOneAltText" : "Gwen with a face melting introduction",
			"pictureTwoPath" : "./images/previousateliers/atelier-three-rich-buttons.jpg",
			"pictureTwoAltText" : "Ritch P with a design masterclass",
			"pictureThreePath" : "./images/previousateliers/atelier-three-dt-heartbreak.jpg",
			"pictureThreeAltText" : "David Turner and the pain testers cause",
			"pictureFourPath" : "./images/previousateliers/atelier-three-sarah-humans.jpg",
			"pictureFourAltText" : "Sarah Tulip on recruiting the best testers"
		},
		{ 
			"class"	: "atelierTwo",
			"eventName" : "Atelier II - Wharf Chambers - Tuesday 19th April 2016",
			"eventDescription" : "We got a new name. After many beers, dismissing such gems as 'Yorkshire Testing Days', we googled workshop synonyms et voila! The Atelier was born! And we moved to a new venue! In order to build on the independent vibe we embody, we moved to Wharf Chambers, a workers co-op bar and gig space in central Leeds. The line up included testers turned entrepreneurs, recent Testing Academy graduates reflecting on their experiences, recent test managers doing the same about organisational change, plus workshops, games, beers, laughs and a very late night for some.",
			"pictureOnePath" : "./images/previousateliers/atelier-two-adam-entre.jpg",
			"pictureOneAltText" : "Adam on his journey from tester to entrepreneur",
			"pictureTwoPath" : "./images/previousateliers/atelier-two-grimmers.jpg",
			"pictureTwoAltText" : "Mike and Clem and testability teapots",
			"pictureThreePath" : "./images/previousateliers/atelier-two-nick-fred.jpg",
			"pictureThreeAltText" : "Nick and Fred talk at their own conference",
			"pictureFourPath" : "./images/previousateliers/atelier-two-walkinshaw.jpg",
			"pictureFourAltText" : "Lesley goes back to the future! Great scott!"
		},
		{ 
			"class"	: "atelierOne",
			"eventName" : "Leeds Testing Unconference - 1 Park Lane, Leeds - Wednesday 23rd September 2015",
			"eventDescription" : "You've got to begin somewhere. This event brought the group together and set the scene for what later become the Atelier. Nevertheless, we had lots of fun, mobile and exploratory testing workshops, discussions on agile heroes, how there are no best practices only good practices in context and many more. And a very, very lengthy version of the dice game...",
			"pictureOnePath" : "./images/previousateliers/atelier-one-crowd.jpg",
			"pictureOneAltText" : "The crowd eagerly await the first unconf",
			"pictureTwoPath" : "./images/previousateliers/atelier-one-history.jpg",
			"pictureTwoAltText" : "A short history of testing",
			"pictureThreePath" : "./images/previousateliers/atelier-one-clem-slide.jpg",
			"pictureThreeAltText" : "Clems slide about Prince Charles and the Prince of Darkness",
			"pictureFourPath" : "./images/previousateliers/atelier-one-brainstorm.jpg",
			"pictureFourAltText" : "Ideas about exploratory testing"
		}
	]
}