{	
	"title": "Leeds Testing Atelier - Home",
	"speakers":
	[
		{ 
			"name"	: "Gem Hill",
			"picture" : "images/speakers/gem.png",
			"title"   : "Make.Believe",
			"abstract" : "This workshop will be centred around mental health. The main activity will be a lean coffee around mental health and wellness in tech and testing, people will be encouraged to share stories and tips, as well as start to break some of the stigma around mental health. There will be resources available for various issues, and the leader will be a trained Mental Health First Aider. Alongside this we'll be making gratitude boxes! A gratitude box or jar is a place where you can store things that make you grateful throughout the year - whether it be written notes of thing that you're grateful for or mementoes of special moments. You can then review these when you need a lift or to be reminded of the good in your life. We'll be providing the box and the craft supplies, you just need to come and get glittery!.",
			"bio" : "I've been a web tester for about 4-5 years now, and currently work for the BBC. I've recently dipped my toes in VR testing for BBC Research and Development. I'm a podcaster, with two podcasts; Lets Talk About Tests, Baby (which is about software testing), and Inner Pod (which is about mental health). I'm also a qualified Mental Health First Aider.",
			"twitter" : "@Gem_Hill"
		},
		{
			"name"	: "Jit Gosai",
			"picture" : "images/speakers/jit.jpg",
			"title"   : "Dice Tower Game: Risk Vs Value",
			"abstract" : "In software development testing everything isn’t possible so you need to strike a balance between the risk of not testing something and the value it will give you if you do test it. This interactive workshop we will get you started on discussions that help you find that balance as a team.",
			"bio" : "Jitesh Gosai (or Jit as he’s better known) has over 14 years Test experience working with a wide variety of companies from Mobile manufactures to OS builders and app developers. He is currently working with the Mobile Platforms team within the BBC to help identify their Test approaches and how the teams move to DevOps and beyond. Starting his career in development, Jit moved into the testing arena as part of his degree and found that it gave him a new angle on the industry.  After developing his work and making a name for himself in the testing scene, he moved towards Development in Test to integrate both his passions.",
			"twitter" : "@JitGo"
		},
		{
			"name"	: "Frances White",
			"picture" : "images/speakers/frances.jpg",
			"title"   : "Manual to Technical : One Tester's Journey",
			"abstract" : "For a tester who wants to code and automate, but has never done so before, stepping into that world can be daunting. I'm going to to tell you how I went from being a manual software tester with no programming experience (and no computing degree) to writing an automation suite of 300 tests in Specflow and .NET.",
			"bio" : "I started as a Manual Software tester six years ago at Skipton Building Society and from there went to EMIS Health, where I learned to program and automate test suites. I am passionate about Specflow, API Automation, Unit Testing and TDD.",
			"twitter" : "@testing_atelier"
		},
		{
			"name"	: "Thomas Crabtree",
			"picture" : "images/speakers/thomas.jpg",
			"title"   : "Agile Learning",
			"abstract" : "It’s about time we started developing people like we develop software. A lot of focus has gone into being more reactive, responding to change, attending to the needs of the business and generally trying to improve the software we build. How much effort and focus goes into developing our people in the same way? I'd argue very little. In this talk, I want to explore ways in which we can become much more agile in how we develop ourselves and others, and look at a set of ideas and a basic framework for doing it.",
			"bio" : "I'm a self-proclaimed testing geek and context-driven tester with over 10 years’ experience creating and delivery testing solutions for clients across a wide range of industries, including financial services, gaming, retail, and technology. I have been running testing training courses for over 3 years and in my role as Head of Service Introduction and Training at Ten10, I am tasked with constantly finding new ways to improve and evolve the training of our people.",
			"twitter" : "@thomascrabs"
		},
		{
			"name"	: "Luke Boucher",
			"picture" : "images/speakers/luke_bo.jpg",
			"title"   : "Dealing with a Psycho!",
			"abstract" : "You might have heard the adage - 'Always code as if the person who ends up maintaining your code is a violent psychopath who knows where you live.'. I can't lecture you on the coding practices but I'll happily talk your arm off about the soft skills that come with dealing with this psycho - what makes a handover, what is 'good' documentation and so on. Because in the end, aren't we all a little bit psycho?",
			"bio" : "A graduate out of Staffordshire University, I was Software Engineer in Test for 3 years before finding my way more recently into Change Management. I like the feeling of making a difference so I've worked in Healthcare and now for a Debt Relief/Management charity. Passionate about puns and dad jokes, I'm a chocoholic with a knack for test automation and ridiculous sprint retrospectives (consider this fair warning).",
			"twitter" : "@lukbou"
		}
	]
}





