{	
	"title": "Leeds Testing Atelier - Home",
	"speakers":
	[
		{ 
			"name"	: "Robyn Daulby",
			"picture" : "images/speakers/robyn_daulby.jpg",
			"title"   : "From Lazy to Junior to Tester - My Testing Journey Lows and Highs",
			"abstract" : "I have always been a terrible student, when I was in full time education I was always doing ‘Just enough’ to get by, I was basically lazy and just wanted an easy life. But now that I’m older and in a job I love, I strive to be better. But I still have those times when the lazy in me comes out or I get disheartened and then I want to hide away. I’ve had to work really had to keep myself on track. Being relatively new to testing this talk will be about my journey and to show some of the lows and highs that I’ve had whilst I’ve been learning to test. One of the lows I had was not understanding the terminology being used around me, it sounds incredibly daft to say that something so simple to me now was a low point. It will show how along the way I’ve had to overcome failures, my inner lazy and picking myself up when I’m disheartened. I will talk about my highs as well, public speaking being my main one, never in a million years did I think I would stand in front of a room full of people and talk, but here I am writing an Abstract to do another talk. Major high. I want people to take away two main things with this talk. Firsty, to new testers, who could be having similar lows to me, I want them to know that they’re not alone!  Its okay to fail, it’s how we learn. It’s okay to have down time, we can’t constantly be learning and that’s okay! And then to the more established tester, I hope to enlighten them to some struggles that others may be having without them realising.",
			"bio" : "Hey, Im Robyn! I’m a Junior Test Analyst working at AO.com. I’ve been testing for a little over a year now and taking a leap of faith and changing my career was the best thing I ever did. I’m very passionate about what I do and I hope that people see my openness and honesty when they talk to me or read my blogs. Ever since I attended my first conference I’ve absolutely loved the testing community, it’s so inclusive! I think you can really get a lot from attending events, even if it’s just a new friend, and I want to be one of those people that helps others on their journey. I may be new to this but a new perspective can often be a good one. I hate thinking that there could be other people struggling and worrying they’re alone with their lows in testing. It could literally just take one person to open up and be honest about their struggles for them to realise they are not alone! I want to be that person and help others the way the community has helped me. When I’m not working I’m all about going to concerts, eating good food, obsessing over my niece, drinking gin and visiting my boyfriend in Scotland. Various combinations of all the above!",
			"twitter" : "@RobynTests"
		},
		{
			"name"	: "Lewis Prescott",
			"picture" : "images/speakers/lewis_prescott.jpg",
			"title"   : "Contract Tests vs Functional Tests in a World of Squads",
			"abstract" : "Asos is a large organisation which has grown significantly over the past few years. This had meant layers of management and teams spawning out of nowhere. I want to discuss my journey of implementing Pact (Contract Testing Framework) in a large organisation. The challenges I faced during the process and the lessons learnt including the technical Part: Setting up the framework in C#, people part: Getting buy in from the wider team and consumers part: Gettting buy in from the wider business.",
			"bio" : "I am currently a QA Engineer at Asos, formerly of 'The Test People' based in the Leeds office. I have a variety of experience at different organisations, usually forming opinions on automation and the best way to adopt it. I currently love writing unit tests and getting involved in testability discussions with my colleagues. I teach coding (python) at a local school in Camden, London. I mentor an intern and another QA here at ASOS. I love to teach and learn from others.",
			"twitter" : "@WuigPrescott"
		},
		{
			"name"	: "Ady Stokes",
			"picture" : "images/speakers/ady.jpg",
			"title"   : "Accessibility, Assumptions and Arguments",
			"abstract" : "There is a massive assumption in software development that accessibility = disability.  I'll dispel that myth with information, examples and practical tips of how our assumptions are potentially costing us customers, making interactions harder and that the whole population has accessibility 'issues' with the applications we are building.",
			"bio" : "I've been in and around testing through audit activities since the mid-1990s and involved in testing and software development since 2005.  I blog, although not often enough, at thebigtestheory.com and have spoken at Leeds Tester Gathering, Agile Yorkshire, Leeds Testing Atelier and at work where I have also run workshops.  I've had positive feedback on my talks but am always happy to hear things to make me improve.",
			"twitter" : "@CricketRulz"
		},
		{
			"name"	: "Alex Moore",
			"picture" : "images/speakers/alex.jpeg",
			"title"   : "Pipelines and Operability  (with Pink Fluffy DevOps Unicorns)",
			"abstract" : "Testing is at the very centre of DevOps.  I'd like to bring Operability testing to life a bit, with some real practical examples as well as a more aspirational view.  This will include testing within a Software delivery pipeline, testing of the pipeline itself and the need to effectively integrate testing and monitoring.",
			"bio" : "I have worked in IT, Marketing, Software Support and Software Delivery before moving into my current System Build (DevOps) role within TransUnion (formerly Callcredit).  I have a passion for continuous improvement and making life easier for everyone.",
			"twitter" : "@smileandeliver"
		},
		{
			"name"	: "Sophie Weston",
			"picture" : "images/speakers/sophie.jpeg",
			"title"   : "It’s Not What You Do (It’s the Way That You Do It)",
			"abstract" : "Earlier this year, I (mostly) hung up my coding shoes and now I spend most of my time coaching teams on how to get going with the ways of DevOps. During my twenty-plus years in IT, I’ve seen many changes to how we produce software but nothing quite like DevOps. In just a few years, it has completely transformed the landscape of how we write, test and deliver software, and has gone from being considered a bit bleeding-edge to being mainstream. I’d like to share some reflections from my own DevOps journey - from newly-employed graduate to fully-fledged DevOps bore - and show that, whilst some of the technology we associate with DevOps such as containers and the cloud may be relatively new, the cultural side of DevOps has been around for much longer than people might think.",
			"bio" : "I’ve worked as a software developer since the mid 1990s, doing everything from writing embedded assembler code for mobile radios, to putting the entire works of Goethe online, to automating DNS provision in AWS.",
			"twitter" : "@srwestons"
		},
		{
			"name"	: "Joe Stead",
			"picture" : "images/speakers/joe.jpg",
			"title"   : "Automating your test infrastructure with Kubernetes",
			"abstract" : "As a developer, I find the most important job I have isn’t writing code, it’s shipping code that delivers value, and code only delivers value if it works. At a company without the most resources, we need to be clever, which is why we relied on Kubernetes to help automate our test infrastructure and increase confidence in our product. Kubernetes is container orchestration - but that doesn’t mean you need to be a docker expert to take advantage of the platform. Testing is imperative to any product, but it can be hard. Long running tests can be painful, especially when running them concurrently isn’t possible because of resource constraints, with kubernetes, we can address this. Tools such as selenium grid can be difficult to orchestrate and deploy, but with kubernetes, it is significantly simplified. Together, we’ll explore how we use Kubernetes to automate our test infrastructure and have greater confidence in our product, and you will learn how you can do the same.",
			"bio" : "Joe is currently working on software that is designed to scale to millions of users concurrently, and he has been for the past 5 years. Prior to that, he spent some time working on security-conscious systems. His current focus is on improving the delivery of effective and usable software.",
			"twitter" : "@Joe_Stead"
		},
		{
			"name"	: "Suman Bala",
			"picture" : "images/speakers/suman.jpeg",
			"title"   : "Automating the World of Sky Sports Mobile",
			"abstract" : "We will take the audience through a challenging & inspiring journey to form a dedicated automation team including career progression of a Manual Tester to Senior Automation Tester, insights into decisions taken to chose automation tools, language used & framework architecture and setting up CI to run tests for Sky Sports mobile across different territories. The audience will learn from the mistakes we made along the way and see what setting up automation from scratch entails.",
			"bio" : "Hiya, this is Suman. I'm Test Lead at Sky Sports & News mobile. I'm responsible for end to end testing in manual & automation. In the past 12 years, I have designed & developed automation frameworks from scratch for various products from middleware graphics library, e-commerce & mobile apps. I'm passionate about proving continuous value through coaching & mentoring. It makes me super happy to see how people’s perspectives have changed about testing throughout my career.",
			"twitter" : "@sumanbala867"
		},
		{
			"name"	: "Phil Sumpton",
			"picture" : "images/speakers/phil.jpeg",
			"title"   : "Automating the World of Sky Sports Mobile",
			"abstract" : "We will take the audience through a challenging & inspiring journey to form a dedicated automation team including career progression of a Manual Tester to Senior Automation Tester, insights into decisions taken to chose automation tools, language used & framework architecture and setting up CI to run tests for Sky Sports mobile across different territories. The audience will learn from the mistakes we made along the way and see what setting up automation from scratch entails.",
			"bio" : "Hey I’m Phil and I’m a Senior Tester for Sky Sports and Sky News mobile apps. I’m passionate about writing automation tests and I’m a fan of automating anything I can  - including my house (Looking at you Alexa and Siri). I love testing and finding the most obscure bugs I can! A part of my role is mentoring others in automation and helping run weekly workshops for people to hone their skills.",
			"twitter" : "@philSumpton"
		},
		{
			"name"	: "Christopher Chant",
			"picture" : "images/speakers/choibot.jpeg",
			"title"   : "The Making of a Conversation",
			"abstract" : "Throughout our careers, we join and form teams with people from all walks of life. We work in a creative industry, and we invest a lot of ourselves into our work so it's essential that we can have crucial conversations while remaining congruent. In our workshop, we'll take you through the Satir Interaction model to exaggerate a conversation, highlighting how much goes on between hearing and seeing someone speak, to responding. You will takeaway a better understanding of congruent conversations, how you interact with others and why you have specific responses, a model to break down interactions allowing you to respond congruently and we’ll look at the process we go through from hearing and seeing someone through to responding.",
			"bio" : "Christopher Chant is a determined and passionate test professional with experience across multiple domains. He has learned to embrace all parts of the development lifecycle as learning opportunities: working in business analysis, development, testing and coaching roles in an attempt to help teams grow and deliver. When not testing, Christopher spends his time running (not often enough), traveling all over the country to watch Nottingham Forest F.C. lose (occasionally they win), jealously looking at other people's dogs and playing board games.",
			"twitter" : "@choibot"
		},
		{
			"name"	: "Vernon Richards",
			"picture" : "images/speakers/vernon.jpeg",
			"title"   : "The Making of a Conversation",
			"abstract" : "Throughout our careers, we join and form teams with people from all walks of life. We work in a creative industry, and we invest a lot of ourselves into our work so it's essential that we can have crucial conversations while remaining congruent. In our workshop, we'll take you through the Satir Interaction model to exaggerate a conversation, highlighting how much goes on between hearing and seeing someone speak, to responding. You will takeaway a better understanding of congruent conversations, how you interact with others and why you have specific responses, a model to break down interactions allowing you to respond congruently and we’ll look at the process we go through from hearing and seeing someone through to responding.",
			"bio" : "I am a software tester with 10 years experience testing products developed in various technologies/languages using Agile (Scrum) and Lean (Kanban), v-model & waterfall methodologies. Testing software and web products across a wide range of industries, whether as part of a co-located or distributed team, means I have a rich vein of first-hand knowledge to draw from.",
			"twitter" : "@testerfromleic"
		},
		{
			"name"	: "Colin Ameigh",
			"picture" : "images/speakers/colin.jpg",
			"title"   : "The Bugs and the Bees",
			"abstract" : "What are bugs?  Where do they come from?  What do they want and is there any way of stopping them?",
			"bio" : "Colin is a software developer with broad experience in telecommunications, internet and e-commerce. Experienced in requirements gathering through product lifecycle including testing. He specialises in databases design and implementation, web based user interfaces to complex systems and high speed data processing. Provides architectural guidance, technical design and leadership in complex projects.",
			"twitter" : "@CAmeigh"
		}
	]
}




