{
	"title": "Leeds Testing Atelier - Home",
	"speakers": [
		{
			"name": "Lauren Borodajko",
			"picture": "images/speakers/lauren-borodajko.jpeg",
			"title": "Organic Quality, it starts with the soil",
			"abstract": "Throughout my career from Tester and Quality Coach to Engineering Manager. I have relied on an approach Organic Quality. This philosophy has consistently helped the teams I work with mature and achieve high performance fast. At its core, Organic Quality is built upon three key values: kindness, curiosity, and credibility. By embracing these values, individuals and teams can create an environment where success feels effortless and work becomes something to genuinely enjoy. Sounds easy right? We all know that when people are involved, things are never easy! In this talk I will walk through the four pillars of Organic Quality: Conscious Awareness, Open Communication, Social Responsibility & Empowered Leadership.  There will be real life stories of our learnings and actionable examples of how everyone can be a little more organic at work.",
			"bio": "I live in West Yorkshire and have been working as an Engineering Manager with my background being in Quality Coaching. I love putting people first, and that is exactly why I stated The Organic Edge Newsletter and started to document Organic Quality. My approach has helped scale engineering teams across the globe ranging from unicorn start-ups to FTSE 250 companies. I have always been curious about how the world works and I am a passionate supporter of changing the narrative around dyslexia."
		},
		{
			"name": "Andy Burgin",
			"picture": "images/speakers/andy-burgin.jpeg",
			"title": "AI Agents - Lets Talk...",
			"abstract": "Let's talk about the latest hot topic in our industry - AI Agents. They might be coming for your job, entire workforces may be replaced by these super-smart chunks of code, so what does it mean for you? We'll also see one in action.",
			"bio": "Andy is by day a Principal Platform Engineer at a gambling firm, by night an opensource AI contributor working with LLMs and AI applications running in Kubernetes. Currently working with K8sGPT to help analyse and diagnose faults on Kubernetes clusters. He also is a small part of the organizing team for DevOpsDays London and ran the DevOps meetup in Leeds for almost a decade hosting over 50 events. He’s attended and has spoken at a bunch of DevOps conferences and in his own words is \"an all-round DevOps nuisance\"."
		},
		{
			"name": "Emily O'Connor",
			"picture": "images/speakers/emilyoc.jpeg",
			"title": "Testing your assumptions - You are not your customer",
			"abstract": "This talk goes over some of the assumptions development teams can make and how recognising them can help teams build better quality products - because you are not your customer.",
			"bio": "Emily O'Connor is a Principal Test Engineer at Audacia, a consultancy that work across a variety of industries. Given each consultant cannot be an expert in each of them - Emily uses this to her advantage by identifying edge cases and test scenarios by recognising the fact that she is not often the companies typical users."
		}
	]
}