{	
	"title": "Leeds Testing Atelier - Home",
	"speakers":
	[
		{ 
			"name"	: "Hannah Pretswell",
			"picture" : "images/speakers/hannah-pretswell.jpg",
			"title"   : "The Sleepy Tester",
			"abstract" : "We all know about the basic human needs: food, water, and shelter. It would be pretty difficult to go about our jobs without those three things. But what about sleep? A lack of sleep is detrimental in so many ways - we can all feel the effects of simply *being* tired, but the harm goes much deeper than that. As testers we need to bring a myriad of skills to be the best we can be: creativity, problem solving, decision making and communication to name just a few. How much does sleep impact these skills and our abilities to improve? This talk will cover the effects of sleep (or lack thereof) on learning, behaviour, and general wellbeing. We don’t expect to be our best selves without basic human needs - why do we neglect sleep so?",
			"bio" : "I am a Software Tester with a fascination for how things you wouldn’t expect can affect your ability to learn, grow, and go about general day to day life. I come from a background in art and animation, and enjoy reading, piano, and aerial fitness.",
			"twitter" : "@hannahpretswell"
		},
		{
			"name"	: "Beth North",
			"picture" : "images/speakers/beth-north.jpg",
			"title"   : "Imposter Syndrome as a Tester",
			"abstract" : "As a Woman in Tech, I’ve experienced my fair share of self-doubt. It wasn’t until a year or two ago that I learned of Imposter Syndrome, something clicked; like someone handed me a cheat sheet to a jigsaw puzzle. Since then I’ve been learning more about psychology and why people react in a certain way to situations and how my own mind fits into all of this. Nearly 70% of people in tech have said they’ve experience Imposter Syndrome in some way. I want to take you on a journey through my career and what I’ve been doing to fight that Imposter Goblin. The one that won’t stop shouting when you’re trying to be your best self. I am by no means an expert in psychology or medicine, but have always found the area interesting. I do not intend for this talk to be a solution for anyone, but more of a personal journey of what I have been doing in my life and how I have worked toward being the best I can be. I will be providing the disclaimer that I have a background in Electronic and Electrical Engineering and that this talk is to talk about my own experiences and perspective of the tech industry. This is a simple and relatable talk on how I’ve managed to ‘get out of my own head’ and learn to live with Imposter Syndrome, that I hope will be able to inspire people to take themselves out of their comfort zone at work or home.",
			"bio" : "Beth is a Senior Software Test Engineer for one of the largest sports betting companies in the UK. She has worked in testing for 4 years, in a wide variety of testing disciplines and is always interested in learning more. In her free time, Beth is a gamer, foodie and gig-attendee; she has an avid interest in learning about science, medicine and history.",
			"twitter" : "@EccentricTester"
		}
	]
}




