{
	"title": "Leeds Testing Atelier - Sponsor Us",
	"sponsors":
		[
			{
				"name"	: "Nimble Approach",
				"picture" : "images/sponsors/nimble-approach-logo.jpg",
				"about" : "Nimble are a tightly knit collective of elite product & technology professionals who love what we do! We’ve taken a people first, quality-driven approach to growing our community by handpicking only people who have the right values, characteristics, and ability.",
				"twitter" : "@nimbleapproach"
			},
			{
				"name"	: "Corecom Consulting",
				"picture" : "images/sponsors/corecom-logo.jpg",
				"about" : "Corecom Consulting is an award-winning IT recruitment company. We serve a wide range of employers: from large scale international businesses to small and medium enterprises. We provide contract and permanent roles in a variety of IT specialisms.",
				"twitter" : "@CorecomIT"
			},
			{
				"name"	: "Ministry of Testing",
				"picture" : "images/sponsors/ministryoftest-logo.jpg",
				"about" : "The Ministry of Testing aims to change and lead within the software testing world.  We are doing this through a strong focus on learning, collaboration and resources.",
				"twitter" : "@ministryoftesting"
			},
			{
				"name"	: "Ady Stokes",
				"picture" : "images/sponsors/ady.jpeg",
				"about" : "I’m passionate about exploring and testing software as part of the creation and development of useful applications. I strongly believe in collaborative methods and using different thinking techniques to look at things from all angles.",
				"twitter" : "@CricketRulz"
			},
			{
				"name"	: "Infinity Works",
				"picture" : "images/sponsors/infinityworks-logo.jpg",
				"about" : "A collective of leading Engineers and Technologists who have the intelligence to devise the right solution, the skills to build it to drive real change in your organisation.",
				"twitter" : "@InfinityWorks"
			},
			{
				"name"	: "The Coders Guild",
				"picture" : "images/sponsors/coders-guild-logo.jpg",
				"about" : "Promoting inclusion, diversity and equality through expert training, coaching and CPD opportunities for software development. A safe space offering community-driven, peer-reviewed and open-source knowledge share.",
				"twitter" : "@the_codersguild"
			},
			{
				"name" : "IBM",
				"picture" : "images/sponsors/ibm-logo.png",
				"about" : "Together with our clients, we're using technologies like AI, cloud, blockchain & IoT to transform business, industries and the world. Let’s put smart to work.",
				"twitter" : "@IBM"
			}
		]
}

